[
    {
      "title": "NC News",
      "imageSrc": "projects/ncnews_screenshot.jpg",
      "description": "A full-stack news application project that allows users to browse, search, and interact with articles stored on a database. The frontend is built on React, it uses techniques such as component-based architecture, state management, routing, and optimistic rendering to enhance the user experience. The backend API creates HTML endpoints to perform secure CRUD operations with an SQL database. The project demonstrates RESTful architecture, Test Driven Development, and the Model-View-Controller Pattern for scalability and maintenance.",
      "skills": ["Javascript", "React", "HTML", "CSS", "Postgres", "Express", "Node"],
      "demo": "https://nc-news-app-dj.netlify.app/",
      "source": "https://github.com/lvl7wizard/nc-news"
    },
    {
      "title": "Plant Pal",
      "imageSrc": "projects/plantpal_screenshot.jpg",
      "description": "A cross platform mobile app for Android and iOS which helps users keep track of their plants and maintain their health in an engaging way. This was a group project for which I predominantly worked on the frontend. For this project I taught myself React Native and utilised Styled Components for styling.",
      "skills": ["React Native", "Javascript", "Styled Components", "CSS", "Express"],
      "demo": "https://northcoders.com/project-phase/plantpal",
      "source": "https://github.com/lvl7wizard/PlantPal"
    },
    {
      "title": "CASIO SL-300SV",
      "imageSrc": "projects/calculator_screenshot.jpg",
      "description": "After reading up about CSS Grid I chose to put my knowledge into practice by copying a pre-existing design. For this project I created a replica of a classic calculator, the Casio SL-300SV. The project utilies various React hooks in combination with equations written in JavaScript to perform the functionality of the calculator.",
      "skills": ["React", "Javascript", "HTML", "CSS"],
      "demo": "https://casio-sl-300sv.netlify.app",
      "source": "https://github.com/lvl7wizard/calculator-app"
    },
    {
      "title": "TIC TAC TOE",
      "imageSrc": "projects/tictactoe_screenshot.jpg",
      "description": "A fun mini project I created using React and Vanilla CSS.",
      "skills": ["React", "CSS", "HTML"],
      "demo": "https://tictactoedj.netlify.app/",
      "source": "https://github.com/lvl7wizard/tictactoe"
    }
  ]