[
  {
    "title": "NC News",
    "imageSrc": "projects/ncnews_screenshot.png",
    "description": "NC News is a React-based frontend web application that provides an interactive interface allowing users to browse, search, like, post, and comment on news articles sourced from a database. Built with React, it utilises features such as component-based architecture, state management, routing, and optimistic rendering to enhance user experience. Limitations: The project does not yet support a fully secure account login and creation system, however, demo accounts are available as instructed on the landing page. The backend API is hosted on a free server, which may take a minute to wake up if requests haven't been made recently.",
    "skills": [
      "Javascript",
      "React",
      "HTML",
      "CSS",
      "Axios"
    ],
    "demo": "https://nc-news-app-dj.netlify.app/",
    "source": "https://github.com/lvl7wizard/nc-news"
  },
  {
    "title": "News API",
    "imageSrc": "projects/newsapi_screenshot.png",
    "description": "News API is a JavaScript-based API built with Express that supports a news application by providing backend functionality. It allows users to interact with a PostgreSQL database through secure CRUD operations. The backend follows RESTful principles and the MVC pattern for scalability and maintainability. This project showcases TDD (Test Driven Development) and handles various operations such as article creation, deletion, and comment management. Limitations: The API is hosted on Render and may take up to a minute to wake up if requests haven't been made recently.",
    "skills": [
      "Javascript",
      "PostgreSQL",
      "Express",
      "Node"
    ],
    "demo": "https://news-app-mk4i.onrender.com/api",
    "source": "https://github.com/lvl7wizard/news-api"
  },
  {
    "title": "Plant Pal",
    "imageSrc": "projects/plantpal_screenshot.jpg",
    "description": "PlantPal is a houseplant management app for Android and iOS that assists users in maintaining their plants health in an engaging way. Plantpal allows users to create an account, take photos of your plants, add details about their watering and feeding dates, see graphic representations of this information through interactions with our MongoDB server, delete plants, and identify plants by sending images to an external AI. This is a group project I worked on in a small group as part of the Northcoders bootcamp where we had 8 days to plan, spike out new technology, and build a product.",
    "skills": [
      "React Native",
      "MongoDB",
      "Javascript",
      "Styled Components",
      "CSS",
      "Express"
    ],
    "demo": "https://northcoders.com/project-phase/plantpal",
    "source": "https://github.com/lvl7wizard/PlantPal"
  },
  {
    "title": "CASIO SL-300SV",
    "imageSrc": "projects/calculator_screenshot.jpg",
    "description": "This project is a replica of a classic calculator, the CASIO SL-300SV. After learning about CSS Grid I chose to put my knowledge into practice by taking a pre-existing design, breaking the design down into HTML elements, and creating a replica using a healthy dose of CSS Grid layout techniques. The project is built using React, it uses various React hooks to perform the basic functionality of all the buttons.",
    "skills": ["React", "Javascript", "HTML", "CSS"],
    "demo": "https://casio-sl-300sv.netlify.app",
    "source": "https://github.com/lvl7wizard/calculator-app"
  },
  {
    "title": "Tic Tac Toe",
    "imageSrc": "projects/tictactoe_screenshot.png",
    "description": "A simple game of tic tac toe. This version of the classic game allows 2 players to engage in the timeless battle between naughts and crosses. I have now migrated this project from JavaScript to TypeScript, this is my first project using TypeScript and completing the migratation was a great way for me to learn about types and module support.",
    "skills": ["React", "TypeScript", "CSS", "HTML"],
    "demo": "https://tictactoedj.netlify.app/",
    "source": "https://github.com/lvl7wizard/tictactoe"
  }
]
