[
  {
    "title": "NC News",
    "imageSrc": "projects/ncnews_screenshot.png",
    "description": "The aim of this project was to create a fullstack application featuring an API and an intuitive user interface. NC News mimics various features found on social news platforms such as the ability for users to browse, search, post, and interact with articles stored on a database. The frontend is built with React and uses techniques such as component-based architecture, state management, routing, and optimistic rendering to enhance the user experience. The backend API is built using JavaScript and Express, it creates a series of HTML endpoints that perform secure CRUD operations with an SQL database and demonstrates RESTful architecture, Test Driven Development, and the Model-View-Controller Pattern for scalability and maintenance.",
    "skills": [
      "Javascript",
      "React",
      "HTML",
      "CSS",
      "PostgreSQL",
      "Express",
      "Node"
    ],
    "demo": "https://nc-news-app-dj.netlify.app/",
    "source": "https://github.com/lvl7wizard/nc-news"
  },
  {
    "title": "Plant Pal",
    "imageSrc": "projects/plantpal_screenshot.jpg",
    "description": "PlantPal is a houseplant management app for Android and iOS that assists users in maintaining their plants health in an engaging way. Plantpal allows users to create an account, take photos of your plants, add details about their watering and feeding dates, see graphic representations of this information through interactions with our MongoDB server, delete plants, and identify plants by sending images to an external AI. This is a group project I worked on in a small group as part of the Northcoders bootcamp where we had 8 days to plan, spike out new technology, and build a product.",
    "skills": [
      "React Native",
      "MongoDB",
      "Javascript",
      "Styled Components",
      "CSS",
      "Express"
    ],
    "demo": "https://northcoders.com/project-phase/plantpal",
    "source": "https://github.com/lvl7wizard/PlantPal"
  },
  {
    "title": "CASIO SL-300SV",
    "imageSrc": "projects/calculator_screenshot.jpg",
    "description": "This project is a replica of a classic calculator, the CASIO SL-300SV. After learning about CSS Grid I chose to put my knowledge into practice by taking a pre-existing design, breaking the design down into HTML elements, and creating a replica using a healthy dose of CSS Grid layout techniques. The project is built using React, it uses various React hooks to perform the basic functionality of all the buttons.",
    "skills": ["React", "Javascript", "HTML", "CSS"],
    "demo": "https://casio-sl-300sv.netlify.app",
    "source": "https://github.com/lvl7wizard/calculator-app"
  },
  {
    "title": "Tic Tac Toe",
    "imageSrc": "projects/tictactoe_screenshot.jpg",
    "description": "A simple game of tic tac toe. This version of the classic game allows 2 players to engage in the timeless battle between naughts and crosses. I have now migrated this project from JavaScript to TypeScript, this is my first project using TypeScript and completing the migratation was a great way for me to learn about types and module support.",
    "skills": ["React", "TypeScript", "CSS", "HTML"],
    "demo": "https://tictactoedj.netlify.app/",
    "source": "https://github.com/lvl7wizard/tictactoe"
  }
]
